DeviceEvents 
| where ActionType == "ExploitGuardNetworkProtectionBlocked"
| extend JsonOut = parse_json(AdditionalFields)
| sort by Timestamp desc 
| project Timestamp, DeviceName, InitiatingProcessAccountName, ActionType,  
         RemoteUrl, InitiatingProcessCommandLine,
         JsonOut.IsAudit,JsonOut.Uri