# T1553.005 - Subvert Trust Controls - Mark-of-the-Web Bypass

Executables tagged with the MOTW will be processed by Windows Defender SmartScreen that compares files with an allowlist of well-known executables. If the file in not known/trusted, SmartScreen will prevent the execution and warn the user not to run it.

---

## Query

```Kusto
A user has overridden a SmartScreen warning and continued to open an untrusted app or a low-reputation URL.
DeviceFileEvents
 | where ActionType == 'SmartScreenUserOverride' 
```

```Kusto
// Defender SmartScreen App Warnings
DeviceEvents
| where ActionType == "SmartScreenAppWarning"
| extend data = parse_json(AdditionalFields)
| extend Experience = parse_json(data).Experience
| project Timestamp, DeviceName, ActionType, FileName,Experience, InitiatingProcessFileName, InitiatingProcessAccountUpn
```



## Category

This query can be used to detect the following attack techniques and tactics ([see MITRE ATT&CK framework](https://attack.mitre.org/)) or security configuration states.

| Technique, tactic, or state | Covered? (v=yes) | Notes |
|-|-|-|
| Initial access |  |  |
| Execution |  |  |
| Persistence |  |  |
| Privilege escalation | |  |
| Defense evasion | v | https://attack.mitre.org/techniques/T1553/005 |
| Credential Access |  |  |
| Discovery |  |  |
| Lateral movement |  |  |
| Collection |  |  |
| Command and control |  |  |
| Exfiltration |  |  |
| Impact |  |  |
| Vulnerability |  |  |
| Misconfiguration |  |  |
| Malware, component |  |  |

## See also

## Contributor info

**Contributor:** Alex Verboon